/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstadd_front.c                                  :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: cflorind <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/04/24 15:07:30 by cflorind          #+#    #+#             */
/*   Updated: 2021/04/26 00:17:46 by cflorind         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
Аргументы:
lst - указатель на указатель первого элемента списка.
new - указатель на новый элемент списка который необходимо добавить.

Возвращаемые значение:
Нет.

Описание:
Функция получает первый элемент переданного списка lst и добавляет перед ним
новый элемент new.
*/
void	ft_lstadd_front(t_list **lst, t_list *new)
{
	if (lst != NULL)
	{
		if (*lst != NULL && new != NULL)
		{
			new->next = *lst;
			*lst = new;
		}
		else
		{
			if (*lst == NULL && new != NULL)
				*lst = new;
			if (*lst != NULL && new == NULL)
			{
				new = (t_list *)ft_calloc(1, sizeof(t_list));
				new->next = *lst;
				*lst = new;
			}
		}
	}
}
