/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstiter.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: cflorind <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/04/24 17:13:58 by cflorind          #+#    #+#             */
/*   Updated: 2021/04/25 11:47:22 by cflorind         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include	"libft.h"

/*
Аргументы:
lst - указатель на элемент списка.
f - указатель на функцию обработки поля content элемента списка.

Возвращаемые значение:
Нет.

Описание:
Функция получает элемент переданного списка lst и применяет к его полю
content функцию f. Функция обрабатывает всех потомков элемента спсика lst пока
не дойдет до конца списка.
*/
void	ft_lstiter(t_list *lst, void (*f)(void *))
{
	t_list	*tmp;

	if (lst && f)
	{
		tmp = lst;
		while (tmp)
		{
			f(tmp->content);
			tmp = tmp->next;
		}
	}
}
