/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putnbr_fd.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: cflorind <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/04/24 13:39:17 by cflorind          #+#    #+#             */
/*   Updated: 2021/04/24 13:45:56 by cflorind         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"
/*
Аргументы:
n - число для записи, из диапазона int.
fd - номер дескриптора файла для записи.

Описание:
Функция записывает преданный int n в фаил с дескриптором fd.
*/
void	ft_putnbr_fd(int n, int fd)
{
	char	*s;

	s = ft_itoa(n);
	if (s)
		write(fd, s, ft_strlen(s));
	free(s);
}
