/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: cflorind <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/04/24 13:12:12 by cflorind          #+#    #+#             */
/*   Updated: 2021/04/24 14:06:10 by cflorind         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
Аргументы:
c - код смивола для записи.
fd - номер дескриптора файла для записи.

Описание:
Функция записывает преданный символ с в фаил с дескриптором fd.
*/
void	ft_putchar_fd(char c, int fd)
{
	write(fd, &c, 1);
}
