/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strrchr.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: cflorind <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/04/19 20:53:48 by cflorind          #+#    #+#             */
/*   Updated: 2021/04/25 15:56:59 by cflorind         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
Аргументы:
str – указатель на строку, в которой будет осуществляться поиск.
c – код искомого символа.

Возвращаемое значение:
Указатель на искомый символ, если он найден в строке str, иначе NULL.

Описание:
Функция ищет первое от КОНЦА строки вхождения символа, код которого указан в
аргументе c, в строке, на которую указывает аргумент str.
*/
char	*ft_strrchr(const char *str, int c)
{
	size_t	index;

	if (str == NULL)
		return (NULL);
	index = ft_strlen(str);
	if (c == 0)
		return ((char *)(str + index));
	while (index--)
	{
		if (str[index] == (char)c)
			return ((char *)(str + index));
	}
	return (NULL);
}
